Dictionaries
-we will try to create a dictionary
-data types with keys and values

In [ ]:
# create a small dictionary
# name of 4 students and their marks {key : value}

studentsMarks = {
    "Ali" : 89,
    "Alia" : 70,
    "Alina" : 45,
    "Amita" : 30
}

print (studentsMarks)

#access elements
studentsMarks["Ali"]

{'Ali': 89, 'Alia': 70, 'Alina': 45, 'Amita': 30}

89

In [24]:
students_grades = {
    "name" : ["Ali", "Alia", "Anita", "Hazirah", "Amin", "Nazree"],
    "Maths" : [96, 95, 94, 92, 90, 80],
    "English" : [87, 90, 96, 92, 90, 80],
    "Science" : [96, 70, 80, 92, 90, 80]
}

print(students_grades)

{'name': ['Ali', 'Alia', 'Anita', 'Hazirah', 'Amin', 'Nazree'], 'Maths': [96, 95, 94, 92, 90, 80], 'English': [87, 90, 96, 92, 90, 80], 'Science': [96, 70, 80, 92, 90, 80]}

In [25]:
students_grades["name"]
students_grades["name"][1]

'Alia'

In [ ]:
import pandas as pd
#method to create dataframe is "DataFrame"
df = pd.DataFrame(students_grades)

print("\nFirst Table \n" ,df)
print("\nSecond Table \n" ,df)
print("\nThird Table \n" ,df)

First Table
       name  Maths  English  Science
0      Ali     96       87       96
1     Alia     95       90       70
2    Anita     94       96       80
3  Hazirah     92       92       92
4     Amin     90       90       90
5   Nazree     80       80       80

Second Table
       name  Maths  English  Science
0      Ali     96       87       96
1     Alia     95       90       70
2    Anita     94       96       80
3  Hazirah     92       92       92
4     Amin     90       90       90
5   Nazree     80       80       80

Third Table
       name  Maths  English  Science
0      Ali     96       87       96
1     Alia     95       90       70
2    Anita     94       96       80
3  Hazirah     92       92       92
4     Amin     90       90       90
5   Nazree     80       80       80

In [ ]:
type(df)
#df is dataframe
#numpy.ndarray

pandas.core.frame.DataFrame

In [33]:
#top part of dataframe 
#5 is default argument
#define how many rows you want
df.head(2)

   name  Maths  English  Science
0   Ali     96       87       96
1  Alia     95       90       70

In [35]:
#print 2 from bottom from df
df.tail(1)

     name  Maths  English  Science
5  Nazree     80       80       80

In [47]:
#we can access certain columns in dataframes too
#math columns 
print("Maths Column Marks")
# print(df["Maths"])
df.iloc[:, [1]]

Maths Column Marks

   Maths
0     96
1     95
2     94
3     92
4     90
5     80

In [48]:
import numpy as np
arrayy = np.array([])
type(arrayy)

numpy.ndarray

In [53]:
#series 

mark_series = pd.Series([1,2,3,4,5])
# type (mark_series)
print(mark_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [54]:
df

      name  Maths  English  Science
0      Ali     96       87       96
1     Alia     95       90       70
2    Anita     94       96       80
3  Hazirah     92       92       92
4     Amin     90       90       90
5   Nazree     80       80       80

In [74]:
#How many marks is nazree receive for English

english_amin = df["English"][4]
# print("Amin got 90 marks")

naz = df.name[5]
naz_english = df.English[5]

print(f"In English {naz} had {naz_english} marks")

In English Nazree had 80 marks

In [ ]:
#core datatypes use in pandas : dataframe , series

# 1. create a series of data pd.series 5 values of temperature
# 2. create one dataframe, create 2 columns; city and temperatue - 5 cities

In [114]:
#series obj - single column, 1D column
temp11 = pd.Series([32,30,31,29,30])
print("Type of temp 11: " ,type(temp11))

#a dictionary of temperatures
#python data object
city_temp = {
    'City' : ["Kuala Lumpur", "Banting", "Klang", "Shah Alam", "Damansara"],
    'temp10' : [32, 29, 31, 30, 28]
}

#creating data frame
temp_df = pd.DataFrame(city_temp)
print("Type of temp_df: " ,type(temp_df))

print(temp_df) #df obj
print(temp11)   #series obj

Type of temp 11:  <class 'pandas.core.series.Series'>
Type of temp_df:  <class 'pandas.core.frame.DataFrame'>
           City  temp10
0  Kuala Lumpur      32
1       Banting      29
2         Klang      31
3     Shah Alam      30
4     Damansara      28
0    32
1    30
2    31
3    29
4    30
dtype: int64

In [115]:
df2 = temp_df #dataframe

df2["temp11"] = temp11

df2

           City  temp10  temp11
0  Kuala Lumpur      32      32
1       Banting      29      30
2         Klang      31      31
3     Shah Alam      30      29
4     Damansara      28      30

In [110]:
temp_df["City"] = {}
temp_df

  City  temp10  temp11 new_temp
0  NaN      32      32      NaN
1  NaN      29      30      NaN
2  NaN      31      31      NaN
3  NaN      30      29      NaN
4  NaN      28      30      NaN

In [116]:
#dataframe creates a column that does not exist
temp_df["empty_temp"] = {}
temp_df

           City  temp10  temp11 empty_temp
0  Kuala Lumpur      32      32        NaN
1       Banting      29      30        NaN
2         Klang      31      31        NaN
3     Shah Alam      30      29        NaN
4     Damansara      28      30        NaN

In [117]:
temp_df["mel_temp"] = {}
temp_df

           City  temp10  temp11 empty_temp mel_temp
0  Kuala Lumpur      32      32        NaN      NaN
1       Banting      29      30        NaN      NaN
2         Klang      31      31        NaN      NaN
3     Shah Alam      30      29        NaN      NaN
4     Damansara      28      30        NaN      NaN

In [119]:
temp_df["mel_temp"] = pd.Series([5,4,1,5,2])
temp_df

           City  temp10  temp11 empty_temp  mel_temp
0  Kuala Lumpur      32      32        NaN         5
1       Banting      29      30        NaN         4
2         Klang      31      31        NaN         1
3     Shah Alam      30      29        NaN         5
4     Damansara      28      30        NaN         2

In [ ]:
#already a dataset?

#save this as a csv file?

temp_df.to_csv("City Temperature without row numbers.csv" ,index = False) #index false so that the rows no tak termasuk

In [137]:
data = {
    'City' : ["Kuala Lumpur", "Kuala Lumpur", "Klang", "Shah Alam", "Damansara"],
    'temp10' : [32, 29, 31, 30, 28]
}

#creating data frame
df = pd.DataFrame(data)

In [132]:
df["City"].value_counts()

City
Kuala Lumpur    2
Klang           1
Shah Alam       1
Damansara       1
Name: count, dtype: int64

In [133]:
df['City'].unique()

array(['Kuala Lumpur', 'Klang', 'Shah Alam', 'Damansara'], dtype=object)

In [134]:
df['City'].duplicated()

0    False
1     True
2    False
3    False
4    False
Name: City, dtype: bool

In [141]:
df2 = df['City'].drop_duplicates(inplace = False)
df2

0    Kuala Lumpur
2           Klang
3       Shah Alam
4       Damansara
Name: City, dtype: object